{"intents": [
    {"tag":"consent",
    "patterns":["yes that makes sense","I consent"],
    "responses":["To begin with, everything we discuss today is bound by strict confidentiality and no information will be disclosed unless we are permitted or compelled to do so by law. May I begin the questions? "],
    "context":[""]},
    {"tag":"diagnosis",
    "patterns":["yes you may","sure"],
    "responses":["Have you or are you currently suffering from domestic violence? Please click the button “Types of Abuse” in a new tab for a description of each type and some examples."],
    "context":["consent"]},
    {"tag":"physical",
    "patterns":["I think my partner is physically abusive."],
    "responses":["Can you describe what occurs in such situations? Please add as much detail as possible. "],
    "context":["diagnosis"]},
    {"tag":"elaborate",
    "patterns":["Something will set her off and she will begin shouting, and throwing stuff. She sometimes gets physical and starts hitting me."],
    "responses":["When did this first begin and how often does this occur?"],
    "context":["physical"]},
    {"tag":"frequency",
    "patterns":["It started when she started working. It happens once a week."],
    "responses":["How long has this been occurring?"],
    "context":["elaborate"]},
    {"tag":"length",
    "patterns":["This has been occurring for about a year"],
    "responses":["Have you ever tried to hit them back?"],
    "context":["frequency"]},
    {"tag":"reciprocate",
    "patterns":["there was a time where she tried to stab me so I kicked her hand."],
    "responses":["Are you worried about you or your family members’ safety?"],
    "context":["length"]},
    {"tag":"family",
    "patterns":["Yes, we have two kids and their safety is my priority. She only hurts me for now but I am worried that she will do something to the kids."],
    "responses":["Have you ever told anyone about this? Have the police been involved?"],
    "context":["reciprocate"]},
    {"tag":"involvement",
    "patterns":["Only my close friends. I’ve never called the police but our neighbours have called the police on us before."],
    "responses":["What are you hoping to achieve through our chat?"],
    "context":["family"]},
    {"tag":"prospect",
     "patterns":["I don't know what to do. This is taking a toll on my mental health. I don’t think I can continue my marriage with her."],
     "responses":["Thank you for telling me about your situation. Here are some possible steps you may want to take based on the answers you provided. If you would like legal assistance, please select the filters below and we will recommend lawyers based on that and the information you have given us. "],
     "context":["involement"]}
]
}